app/controllers/login_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'aditya.vmvs@tamu.edu' LIMIT 1
---
  def omniauth_callback
    auth = request.env["omniauth.auth"]

    user = User.find_or_initialize_by(email: auth.info.email)